// Работа с плагинами

// Основные функции ==============================================================
import  * as fls from './modules/functions.js';

// Добавление класа Loaded после загркзки страницы
fls.addLoadedClass();

//Бургер меню
fls.menuInit();

// Динамический адаптив ===========================================================
import { useDynamicAdapt } from './modules/libs/dinamicAdaptive.js'
useDynamicAdapt()

// Работа с формами ===============================================================

// Проверка форм
import './modules/forms/forms.js'

//Маски для инпутов
// import './modules/forms/inputmasks.js'

// Работа со скролом ============================================================== 

// Ленивая подгрузка
import './modules/scroll/lazyload.js'

// Фикированая шапка анимация при скроле и тд.
import  * as scroll from './modules/scroll/scroll.js'
scroll.fixedHead();

// Кастомный скрол
// import './modules/scroll/simplebar.js'

// Аккордеоны =====================================================================
import './modules/accordion.js'

// Табы ===========================================================================
// import './modules/tabs.js'

// Слайдер ========================================================================
import './modules/slider.js'

// Попапы =========================================================================
// import './modules/popUps.js'

// Галерея ========================================================================
// import './modules/gallary.js'

// Карты ==========================================================================
import './modules/map.js'

// Подсказки ======================================================================
// import './modules/tippy.js'

// Селекты ========================================================================
import './modules/select.js'

// Счетчик чисел ==================================================================
import './modules/counter.js'

// Календарь ======================================================================
import './modules/datepicker.js'

// Паралакс =======================================================================
// import './modules/paralax.js'

// Свои скрипты
import './modules/script.js'